# Домашнее задание к работе 6

## Условие задачи
Дано число N (N < 1000). Написать программу, которая проверяет является ли произведение его цифр трехзначным числом.

## 1. Алгоритм и блок-схема

### Алгоритм
1. **Начало**
2. Объявить переменные:
   - `N` - исходное число
   - `digit1`, `digit2`, `digit3` - цифры числа
   - `product` - произведение цифр
   - `is_three_digit` - результат проверки
3. Ввести исходные данные:
   - `N` - число для проверки
4. Определить разрядность числа и вычислить произведение цифр:
   - Если `N < 10` (однозначное):
     - `digit1 = N`
     - `product = digit1`
   - Если `10 ≤ N < 100` (двузначное):
     - `digit1 = N / 10`
     - `digit2 = N % 10`
     - `product = digit1 * digit2`
   - Если `N ≥ 100` (трехзначное):
     - `digit1 = N / 100`
     - `digit2 = (N / 10) % 10`
     - `digit3 = N % 10`
     - `product = digit1 * digit2 * digit3`
5. Проверить условие:
   - `is_three_digit = (product ≥ 100 && product ≤ 999)`
6. Вывести результаты проверки с подстановкой всех значений в текст.
7. **Конец**

## 2. Реализация программы

```c
#include <stdio.h>
#include <locale.h>

int main() {
    setlocale(LC_ALL, "");
    
    int N;
        
    // Разложение числа на цифры
    int digit1, digit2, digit3;
    int product;

    printf("ПРОГРАММА ПРОВЕРКИ ПРОИЗВЕДЕНИЯ ЦИФР ЧИСЛА\n");
    printf("==========================================\n\n");
    
    printf("Введите число N: ");
    scanf("%d", &N);
    
    if (N < 10) {
        // Однозначное число
        digit1 = N;
        product = digit1;
        printf("\nЧисло: %d (однозначное)\n", N);
        printf("Цифры: %d\n", digit1);
    } else if (N < 100) {
        // Двузначное число
        digit1 = N / 10;
        digit2 = N % 10;
        product = digit1 * digit2;
        printf("\nЧисло: %d (двузначное)\n", N);
        printf("Цифры: %d, %d\n", digit1, digit2);
    } else {
        // Трехзначное число
        digit1 = N / 100;
        digit2 = (N / 10) % 10;
        digit3 = N % 10;
        product = digit1 * digit2 * digit3;
        printf("\nЧисло: %d (трехзначное)\n", N);
        printf("Цифры: %d, %d, %d\n", digit1, digit2, digit3);
    }
    
    printf("Произведение цифр: %d\n", product);
    
    // Проверка является ли произведение трехзначным числом
    int is_three_digit = (product >= 100 && product <= 999);
    
    printf("\nРЕЗУЛЬТАТ ПРОВЕРКИ:\n");
    printf("===================\n");
    printf("Произведение цифр %d %s трехзначным числом\n", 
           product, is_three_digit ? "является" : "не является");
    
    if (is_three_digit) {
        printf("Условие выполнено\n");
    } else {
        printf("Условие не выполнено\n");
    }
    
    return 0;
}
```

## 3. Результаты работы программы

```
ПРОГРАММА ПРОВЕРКИ ПРОИЗВЕДЕНИЯ ЦИФР ЧИСЛА
==========================================

Введите число N: 128

Число: 128 (трехзначное)
Цифры: 1, 2, 8
Произведение цифр: 16

РЕЗУЛЬТАТ ПРОВЕРКИ:
===================
Произведение цифр 16 не является трехзначным числом
Условие не выполнено
```

```
ПРОГРАММА ПРОВЕРКИ ПРОИЗВЕДЕНИЯ ЦИФР ЧИСЛА
==========================================

Введите число N: 999

Число: 999 (трехзначное)
Цифры: 9, 9, 9
Произведение цифр: 729

РЕЗУЛЬТАТ ПРОВЕРКИ:
===================
Произведение цифр 729 является трехзначным числом
Условие выполнено
```

## 4. Информация о разработчике

Маркина Елена, группа бТИИ-251
